app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 8]]
---
   def show
     @user = User.find(@article.user_id)

INSERT INTO "articles" ("title", "body", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hamada"], ["body", "<p>asdsadasdasdasdasdasd</p>"], ["image", "hotlinemiami2wrongnumber.png"], ["created_at", "2015-03-12 18:50:15.266012"], ["updated_at", "2015-03-12 18:50:15.266012"]]
---
   def create
     @article.user = current_user
     # Author: Mayar
     # Date: 7.4.2015
     # Description: adding magazine parameter to article of magazine
     unless params[:magazine_id].nil?
       @article.magazine_id = params[:magazine_id]
     end
     # Author: Mohammed El-Ansary
     # 1.4.2015
     # Filling the plain body which is used in the search
     @article.plain_body = ActionView::Base.full_sanitizer
       .sanitize(@article.body)
     respond_to do |format|
       if @article.save